{
  "format": "layers-model",
  "generatedBy": "keras v2.21.0",
  "convertedBy": "custom-export v1.0",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "name": "input_layer",
            "batch_input_shape": [
              null,
              21
            ],
            "dtype": "float32",
            "sparse": false
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_3",
            "units": 16,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_output",
            "units": 3,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "dtype": "float32"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "dense_1/kernel",
          "shape": [
            21,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            64,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/kernel",
          "shape": [
            32,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/bias",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_output/kernel",
          "shape": [
            16,
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_output/bias",
          "shape": [
            3
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}